notes/travis-org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2018-12-01 土 16:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Travis CIでEmacs org-modeのページを自動デプロイ</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeki Karita" />
<link rel="stylesheet" type="text/css" href="/css/org.css"/>
 <link href="/css/code.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">Travis CIでEmacs org-modeのページを自動デプロイ</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga92085b">1. 自動デプロイまでの道のりと情報源</a></li>
</ul>
</div>
</div>
<p>
いままで，ローカルでorg-modeの記事を書いて一々手作業で <code>C-x C-e h h</code> とかコマンドうってHTML化して <code>git push</code> で公開してました．github上でpushされればTravis上のEmacsで自動的にHTML化してgithub pagesとして公開されれば，手元にEmacsがないときもGitHub上でorgファイルを編集すれば自動でウェブでHTMLが読めたら便利だなと思いました．例えばスマホとかでメモ代わりに使えます．
</p>

<p>
全体のスクリプトとしてはこんなことをやってます (.travis.yml)．注意点としてユーザ名.github.ioのリポジトリではmasterブランチしか公開されないので，devなど適当な別名ブランチからmasterにデプロイする方法をとっています．
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">language</span>: bash

<span class="org-variable-name">dist</span>: xenial

<span class="org-variable-name">cache</span>: apt

<span class="org-variable-name">script</span>:
  <span class="org-comment-delimiter"># </span><span class="org-comment">install emacs</span>
  - sudo add-apt-repository ppa:kelleyk/emacs --yes
  - sudo apt-get update -qq
  - sudo apt-get install -qq emacs26-nox
  - sudo ln -sf /usr/bin/emacs26 /usr/bin/emacs
  - emacs --version
  <span class="org-comment-delimiter"># </span><span class="org-comment">install bibtex2html</span>
  - wget http://www.lri.fr/~filliatr/ftp/bibtex2html/bibtex2html-1.99-linux.tar.gz
  - tar -xf bibtex2html-1.99-linux.tar.gz
  - export PATH=`pwd`/bibtex2html-1.99-linux:$PATH
  <span class="org-comment-delimiter"># </span><span class="org-comment">build HTML</span>
  - emacs -l ./install.el --batch
  - ./export_all.sh

<span class="org-variable-name">deploy</span>:
  <span class="org-variable-name">provider</span>: pages
  <span class="org-variable-name">target-branch</span>: master
  <span class="org-variable-name">skip_cleanup</span>: <span class="org-constant">true</span>
  <span class="org-variable-name">github_token</span>: $GITHUB_TOKEN <span class="org-comment-delimiter"># </span><span class="org-comment">Set in travis-ci.org dashboard</span>
  <span class="org-variable-name">on</span>:
    <span class="org-variable-name">branch</span>: dev
</pre>
</div>

<p>
<code>install.el</code> は org-mode のHTML化に使う言語モードなどのパッケージなどをインストールするスクリプトです．よくある <code>$HOME/.emacs.d/init.el</code> に書くような感じです．ここで誤解しやすいのはスクリプトモードのemacsは <code>.emacs/init.el</code> を使ってくれないようです．しかしインストールされたパッケージはやはり <code>$HOME/.emacs.d/elpa</code> に配置されるため，CIでは一度だけ実行すれば良いです．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">#!emacs --script

(<span class="org-keyword">require</span> '<span class="org-constant">package</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">MELPA</span>
(add-to-list 'package-archives '(<span class="org-string">"melpa"</span> . <span class="org-string">"https://melpa.org/packages/"</span>) t)
<span class="org-comment-delimiter">;; </span><span class="org-comment">Org</span>
(add-to-list 'package-archives '(<span class="org-string">"org"</span> . <span class="org-string">"http://orgmode.org/elpa/"</span>) t)

(package-initialize)
(package-refresh-contents)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">my/favorite-packages</span>
  '(
    d-mode
    cuda-mode
    lua-mode
    yaml-mode
    htmlize
    spacemacs-theme
    ))

<span class="org-comment-delimiter">;; </span><span class="org-comment">my/favorite-packages</span>
(<span class="org-keyword">dolist</span> (package my/favorite-packages)
  (<span class="org-keyword">unless</span> (package-installed-p package)
    (package-install package)))
</pre>
</div>

<p>
<code>export.el</code> にはHTML化のための設定を書いています．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">install.el &#12391;&#20837;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;</span>
(<span class="org-keyword">require</span> '<span class="org-constant">package</span>)
(package-initialize)

<span class="org-comment-delimiter">;;; </span><span class="org-comment">&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#12425;&#12394;&#12356;&#35373;&#23450;</span>
(<span class="org-keyword">setq</span> make-backup-files nil)
(<span class="org-keyword">setq</span> auto-save-default nil)

<span class="org-comment-delimiter">;; </span><span class="org-comment">bibtex2html &#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12364;&#24517;&#35201;</span>
(<span class="org-keyword">require</span> '<span class="org-constant">ox-bibtex</span>)
(<span class="org-keyword">setq</span> org-html-htmlize-output-type 'css)

<span class="org-comment-delimiter">;; </span><span class="org-comment">css &#12434;&#22475;&#12417;&#36796;&#12414;&#12394;&#12356;</span>
(<span class="org-keyword">setq</span> org-html-htmlize-output-type 'css)

<span class="org-comment-delimiter">;; </span><span class="org-comment">&#12473;&#12479;&#12452;&#12523;&#12471;&#12540;&#12488;&#12394;&#12393;&#12504;&#12483;&#12480;&#12540;&#12398;&#35373;&#23450;</span>
(<span class="org-keyword">setq</span> org-html-head
<span class="org-string">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"/css/org.css\"/&gt;</span>
<span class="org-string"> &lt;link href=\"/css/code.css\" rel=\"stylesheet\"&gt;</span>
<span class="org-string">"</span>
)
</pre>
</div>

<p>
<code>export_all.sh</code> はシェルスクリプトで <code>export.el</code> を使って全orgファイルをHTML化するやつです．こういうのはシェルスクリプトが楽ですね．
</p>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/</span><span class="org-keyword">env</span><span class="org-comment"> bash</span>

<span class="org-keyword">for</span> f<span class="org-keyword"> in</span> **/*.org; <span class="org-keyword">do</span>
    <span class="org-builtin">echo</span> <span class="org-string">"=== building $f ==="</span>
    emacs $<span class="org-variable-name">f</span>  -l <span class="org-sh-quoted-exec">`pwd`</span>/export.el --batch -f org-html-export-to-html
<span class="org-keyword">done</span>
</pre>
</div>

<div id="outline-container-orga92085b" class="outline-2">
<h2 id="orga92085b"><span class="section-number-2">1</span> 自動デプロイまでの道のりと情報源</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>emacs をスクリプトとして実行する方法が解説されています．Emacs上で泥臭くやってる作業を色々自動化できそう． <a href="https://emacs.stackexchange.com/questions/7629/the-syntax-highlight-and-indentation-of-source-code-block-in-exported-html-file">https://emacs.stackexchange.com/questions/7629/the-syntax-highlight-and-indentation-of-source-code-block-in-exported-html-file</a></li>
<li>いままでHTMLヘッダー(CSSスタイルやMathJaxとか，Google Analytics)を手動で挿入していたのですが， <code>org-html-head</code> を指定すると自動で全体のヘッダーを定義できることがわかりました．一箇所で変更しやすいです． <a href="https://emacs.stackexchange.com/questions/7629/the-syntax-highlight-and-indentation-of-source-code-block-in-exported-html-file">https://emacs.stackexchange.com/questions/7629/the-syntax-highlight-and-indentation-of-source-code-block-in-exported-html-file</a></li>
<li>htmlizeがうまく色をつけてくれなくて困っていたのですが，自前のCSSを定義できることがわかりました． <a href="https://emacs.stackexchange.com/questions/7629/the-syntax-highlight-and-indentation-of-source-code-block-in-exported-html-file">https://emacs.stackexchange.com/questions/7629/the-syntax-highlight-and-indentation-of-source-code-block-in-exported-html-file</a></li>
<li>htmlizeのcss一例 <a href="https://github.com/fniessen/org-html-themes/blob/master/styles/readtheorg/css/htmlize.css">https://github.com/fniessen/org-html-themes/blob/master/styles/readtheorg/css/htmlize.css</a></li>
<li>今回はspacemacsの設定に合わせてみた <a href="https://github.com/nashamri/spacemacs-theme/blob/c162ad13e4ae1965619012332d3b5f57c9172e98/spacemacs-common.el#L107">https://github.com/nashamri/spacemacs-theme/blob/c162ad13e4ae1965619012332d3b5f57c9172e98/spacemacs-common.el#L107</a></li>
<li>Travisのデプロイ設定 <a href="https://docs.travis-ci.com/user/deployment/pages/">https://docs.travis-ci.com/user/deployment/pages/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Shigeki Karita</p>
<p class="date">Created: 2018-12-01 土 16:46</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
